# -*- coding: utf-8 -*-


class NonSenceWord(object):
    pun = [
        '?', '；', '∶', '，', '?', '‘', '’', '“', '”', '。', '？', '、', '!', '（', '）',
        '(', ')', '《', '》', '<', '>', '……', '——', ';', ':', '：', '！', '。',
    ]
    # 人称代词
    pron_per = [
        '我', '我们', '你', '你们', '他', '他们', '她', '她们', '它', '它们', '自己', '咱',
        '咱们', '俺们', '俺'
    ]
    # 疑问代词
    pron_int = [
        '什么', '哪里', '为什么', '怎么', '哪个', '谁', '如何', '怎样', '怎么办',
        '哪些', '怎么样', '什么时候', '哪天', '哪年', '哪样', '哪边', '多少钱', '第几',
        '多少', '哪里人', '哪'
    ]
    # 指示代词
    pron_dem = [
        '这', '这些', '那', '那里', '这么', '这样'
    ]
    
    stopwords = [
        '的', '了', '地', '啊', '呢', '吧', '得', '是', '时候', '在'
    ]
    
    nonsenceword = pron_per + pron_dem + stopwords + pun